In [1]:
import pandas as pd

In [2]:
csv = pd.read_csv('employees.csv')
csv

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [3]:
csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

In [4]:
csv.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,10.0,5.5,3.027650,1.0,3.25,5.5,7.75,10.0
Age,10.0,35.3,7.958922,26.0,29.25,33.0,40.25,50.0
Salary,10.0,68300.0,13106.826042,50000.0,57250.00,69000.0,74250.00,90000.0

In [5]:
csv[csv["Department"] == "IT"]

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [6]:
x = csv.groupby('Department')['Age'].mean()
x

Department
Finance      47.500000
HR           33.000000
IT           29.666667
Marketing    35.000000
Name: Age, dtype: float64

In [7]:
csv["5%Salary"] = csv['Salary'] + csv['Salary'] * 0.05
csv

   ID           Name Department  Age  Salary Joining_Date  5%Salary
0   1       John Doe         HR   28   50000   2020-05-21   52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12   78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15   89250.0
3   4    Alice White         IT   29   72000   2021-01-04   75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30   71400.0
5   6      Eva Green         HR   41   54000   2017-04-22   56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19   94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10   67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08   73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18   57750.0

In [8]:
sortedDate = csv.sort_values('Age',ascending=False) # Sort Descending
sortedDate

   ID           Name Department  Age  Salary Joining_Date  5%Salary
6   7     Mike Davis    Finance   50   90000   2016-08-19   94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15   89250.0
5   6      Eva Green         HR   41   54000   2017-04-22   56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08   73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12   78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30   71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18   57750.0
3   4    Alice White         IT   29   72000   2021-01-04   75600.0
0   1       John Doe         HR   28   50000   2020-05-21   52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10   67200.0

In [9]:
x = csv['Department'].value_counts()
x

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [10]:
csv['Joining_Date'] = pd.to_datetime(csv['Joining_Date'])
csv

   ID           Name Department  Age  Salary Joining_Date  5%Salary
0   1       John Doe         HR   28   50000   2020-05-21   52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12   78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15   89250.0
3   4    Alice White         IT   29   72000   2021-01-04   75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30   71400.0
5   6      Eva Green         HR   41   54000   2017-04-22   56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19   94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10   67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08   73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18   57750.0

In [11]:
csv[csv['Joining_Date'] > '2020-01-01']

   ID          Name Department  Age  Salary Joining_Date  5%Salary
0   1      John Doe         HR   28   50000   2020-05-21   52500.0
3   4   Alice White         IT   29   72000   2021-01-04   75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10   67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08   73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18   57750.0

In [13]:
csv.to_csv('new_data.csv')